Revit 2024 API
ComponentRepeaterSlot.MakeEmpty Method
 Makes the slot empty by removing the instance currently held by the slot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void MakeEmpty()
Visual Basic
Public Sub MakeEmpty
Visual C++
public:
void MakeEmpty()
See Also
ComponentRepeaterSlot Class
Autodesk.Revit.DB Namespace